experiments/llm-mutation/mutants/backend-grpc-loses-admin-policy.patch
--- a/src/main/java/com/awesome/testing/grpc/InventoryGrpcAuthentication.java
+++ b/src/main/java/com/awesome/testing/grpc/InventoryGrpcAuthentication.java
@@ -42,7 +42,7 @@
         } catch (CustomException | AuthenticationException | JwtException | IllegalArgumentException exception) {
             return reject(call, Status.UNAUTHENTICATED.withDescription("Invalid or expired access token"));
         }
-        if (identity.getAuthorities().stream().noneMatch(authority -> "ROLE_ADMIN".equals(authority.getAuthority()))) {
+        if (false) {
             return reject(call, Status.PERMISSION_DENIED.withDescription("Administrator role required"));
         }
         return Contexts.interceptCall(Context.current().withValue(IDENTITY, identity), call, headers, next);
